app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `employes`
WHERE `role` != 'admin'
SELECT COUNT(*) AS `numrows` FROM `departements`
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'en_attente'
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'approuvee'
SELECT *
FROM `conges`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT `conges`.*, `employes`.`nom`, `employes`.`prenom`, `types_conge`.`libelle`
FROM `conges`
LEFT JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
LEFT JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`statut` = 'approuvee'
AND `conges`.`date_debut` <= '2026-05-13'
AND `conges`.`date_fin` >= '2026-05-13'
ORDER BY `conges`.`date_fin` ASC
 LIMIT 10
SELECT `soldes`.*, `employes`.`nom`, `employes`.`prenom`
FROM `soldes`
LEFT JOIN `employes` ON `employes`.`id` = `soldes`.`employe_id`
WHERE `annee` = '2026'
---
    public function dashboard()
    {
        // Compter les employés SANS qdmin
        $nbEmployes = $this->employeModel->builder()
            ->where('role !=', 'admin')
            ->countAllResults();

        $nbDepartements = $this->departementModel->countAll();
        $nbTypesCong = $this->typeCongeModel->countAll();

        // Compter les demandes par statut
        $nbEnAttente = $this->congeModel->builder()->where('statut', 'en_attente')->countAllResults();
        $nbApprouvee = $this->congeModel->builder()->where('statut', 'approuvee')->countAllResults();

        // Récupérer les 5 dernières demandes pour affichage
        $dernieresDemandes = $this->congeModel->orderBy('created_at', 'DESC')->limit(5)->findAll();

        // Employés absents aujourd'hui
        $today = date('Y-m-d');
        $absentAujourdhui = $this->congeModel->builder()
            ->select('conges.*, employes.nom, employes.prenom, types_conge.libelle')
            ->join('employes', 'employes.id = conges.employe_id', 'left')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id', 'left')
            ->where('conges.statut', 'approuvee')
            ->where('conges.date_debut <=', $today)
            ->where('conges.date_fin >=', $today)
            ->orderBy('conges.date_fin', 'ASC')
            ->limit(10)
            ->get()
            ->getResultArray();

        $soldesCritiques = $this->soldeModel->builder()
            ->select('soldes.*, employes.nom, employes.prenom')
            ->join('employes', 'employes.id = soldes.employe_id', 'left')
            ->where('annee', date('Y'))
            ->get()
            ->getResultArray();

SELECT *
FROM `employes`
---
    public function ajaxEmployes()
    {
        $employes = $this->employeModel->findAll();

SELECT *
FROM `departements`
---
    public function ajaxDepartements()
    {
        $departements = $this->departementModel->findAll();

SELECT `soldes`.*, `employes`.`nom`, `employes`.`prenom`, `types_conge`.`libelle`
FROM `soldes`
LEFT JOIN `employes` ON `employes`.`id` = `soldes`.`employe_id`
LEFT JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
WHERE `annee` = '2026'
ORDER BY `soldes`.`employe_id` ASC
---
    public function ajaxSoldes()
    {
        $soldes = $this->soldeModel->builder()
            ->select('soldes.*, employes.nom, employes.prenom, types_conge.libelle')
            ->join('employes', 'employes.id = soldes.employe_id', 'left')
            ->join('types_conge', 'types_conge.id = soldes.type_conge_id', 'left')
            ->where('annee', date('Y'))
            ->orderBy('soldes.employe_id', 'ASC')
            ->get()
            ->getResultArray();

INSERT INTO `departements` (`nom`, `description`) VALUES ('Trésorerie', 'Gestion vola')
---
    public function createDepartement()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'nom' => 'required|string',
            'description' => 'permit_empty|string',
        ]);

        if (!$validation->run($this->request->getPost())) {
            if ($this->request->isAJAX()) {
                return $this->response->setStatusCode(422)->setJSON([
                    'success' => false,
                    'errors' => $validation->getErrors(),
                ]);
            }

            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        $data = [
            'nom' => $this->request->getPost('nom'),
            'description' => $this->request->getPost('description'),
        ];

        if ($this->departementModel->insert($data)) {

SELECT *
FROM `departements`
WHERE `departements`.`id` = '2'
DELETE FROM `departements`
WHERE `id` IN ('2')
---
    public function deleteDepartement($id)
    {
        $departement = $this->departementModel->find($id);
        if (!$departement) {
            throw new PageNotFoundException('Département non trouvé');
        }

        if ($this->departementModel->delete($id)) {