app/Controllers/EmployeController.php

    private function getSoldesAnnee(int $employeId, int $annee): array
    {
        $soldes = $this->soldeModel
            ->where('employe_id', $employeId)
            ->where('annee', $annee)
            ->findAll();
---
SELECT *
FROM `soldes`
WHERE `employe_id` = 2
AND `annee` = 2026

    private function getEmployeCourant(): array
    {
        return $this->employeModel->find($this->userId) ?: [];
---
SELECT *
FROM `employes`
WHERE `employes`.`id` = 2

    private function getDepartementCourant(array $user): array
    {
        if (empty($user['departement_id'])) {
            return [];
        }

        return $this->departementModel->find((int) $user['departement_id']) ?: [];
---
SELECT *
FROM `departements`
WHERE `departements`.`id` = 1