app/Controllers/RHController.php

    private function countCongesByStatut(string $statut): int
    {
        return $this->congeModel
            ->builder()
            ->where('statut', $statut)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'en_attente'

    private function getDemandesEnrichies(?string $statut = null, ?string $departementId = null, ?int $limit = null, ?int $employeId = null): array
    {
        $builder = $this->congeModel->builder();
        $builder->select('conges.*, employes.nom, employes.prenom, employes.email, employes.role, departements.nom AS departement_nom, types_conge.libelle AS type_libelle')
            ->join('employes', 'employes.id = conges.employe_id', 'left')
            ->join('departements', 'departements.id = employes.departement_id', 'left')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id', 'left');

        if ($statut) {
            $builder->where('conges.statut', $statut);
        }

        if ($departementId !== null && $departementId !== '') {
            $builder->where('employes.departement_id', $departementId);
        }

        if ($employeId !== null) {
            $builder->where('conges.employe_id', $employeId);
        }

        $builder->orderBy('conges.created_at', 'DESC');

        if ($limit !== null) {
            $builder->limit($limit);
        }

        $demandes = $builder->get()->getResultArray();
---
SELECT `conges`.*, `employes`.`nom`, `employes`.`prenom`, `employes`.`email`, `employes`.`role`, `departements`.`nom` AS `departement_nom`, `types_conge`.`libelle` AS `type_libelle`
FROM `conges`
LEFT JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
LEFT JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`statut` = 'en_attente'
ORDER BY `conges`.`created_at` DESC