app/Models/Conge.php

SELECT *
FROM `conges`
WHERE `employe_id` = 2
ORDER BY `date_debut` DESC
---
    public function listByEmploye(int $employeId): array
    {
        return $this->where('employe_id', $employeId)
            ->orderBy('date_debut', 'DESC')
            ->findAll();