app/Models/Departement.php

    public function getDepartements(): array
    {
        return $this->orderBy('nom', 'ASC')->findAll();
---
SELECT *
FROM `departements`
ORDER BY `nom` ASC