app/Models/Employe.php

    public function findByEmail(string $email): ?array
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `employes`
WHERE `email` = 'jean@tech.mg'
 LIMIT 1